MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1947/mcu.h
extern volatile LCDDATA10bits_t LCDDATA10bits __at(0x7AA);
// bitfield macros
#define _LCDDATA10_SEG8COM3_POSN                            0x0
#define _LCDDATA10_SEG8COM3_POSITION                        0x0
#define _LCDDATA10_SEG8COM3_SIZE                            0x1
#define _LCDDATA10_SEG8COM3_LENGTH                          0x1
#define _LCDDATA10_SEG8COM3_MASK                            0x1
#define _LCDDATA10_SEG9COM3_POSN                            0x1
#define _LCDDATA10_SEG9COM3_POSITION                        0x1
#define _LCDDATA10_SEG9COM3_SIZE                            0x1
#define _LCDDATA10_SEG9COM3_LENGTH                          0x1
#define _LCDDATA10_SEG9COM3_MASK                            0x2
#define _LCDDATA10_SEG10COM3_POSN                           0x2
#define _LCDDATA10_SEG10COM3_POSITION                       0x2
#define _LCDDATA10_SEG10COM3_SIZE                           0x1
#define _LCDDATA10_SEG10COM3_LENGTH                         0x1
#define _LCDDATA10_SEG10COM3_MASK                           0x4
#define _LCDDATA10_SEG11COM3_POSN                           0x3
#define _LCDDATA10_SEG11COM3_POSITION                       0x3
#define _LCDDATA10_SEG11COM3_SIZE                           0x1
#define _LCDDATA10_SEG11COM3_LENGTH                         0x1
#define _LCDDATA10_SEG11COM3_MASK                           0x8
#define _LCDDATA10_SEG12COM3_POSN                           0x4
#define _LCDDATA10_SEG12COM3_POSITION                       0x4
#define _LCDDATA10_SEG12COM3_SIZE                           0x1
#define _LCDDATA10_SEG12COM3_LENGTH                         0x1
#define _LCDDATA10_SEG12COM3_MASK                           0x10
#define _LCDDATA10_SEG13COM3_POSN                           0x5
#define _LCDDATA10_SEG13COM3_POSITION                       0x5
#define _LCDDATA10_SEG13COM3_SIZE                           0x1
#define _LCDDATA10_SEG13COM3_LENGTH                         0x1
#define _LCDDATA10_SEG13COM3_MASK                           0x20
#define _LCDDATA10_SEG14COM3_POSN                           0x6
#define _LCDDATA10_SEG14COM3_POSITION                       0x6
#define _LCDDATA10_SEG14COM3_SIZE                           0x1
#define _LCDDATA10_SEG14COM3_LENGTH                         0x1
#define _LCDDATA10_SEG14COM3_MASK                           0x40
#define _LCDDATA10_SEG15COM3_POSN                           0x7
#define _LCDDATA10_SEG15COM3_POSITION                       0x7
#define _LCDDATA10_SEG15COM3_SIZE                           0x1
#define _LCDDATA10_SEG15COM3_LENGTH                         0x1
#define _LCDDATA10_SEG15COM3_MASK                           0x80

// Register: LCDDATA11
#define LCDDATA11 LCDDATA11
extern volatile unsigned char           LCDDATA11           __at(0x7AB);
#ifndef _LIB_BUILD
asm("LCDDATA11 equ 07ABh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SEG16COM3              :1;
        unsigned SEG17COM3              :1;
        unsigned SEG18COM3              :1;
        unsigned SEG19COM3              :1;
        unsigned SEG20COM3              :1;
        unsigned SEG21COM3              :1;
        unsigned SEG22COM3              :1;
        unsigned SEG23COM3              :1;
    };
} LCDDATA11bits_t;
extern volatile LCDDATA11bits_t LCDDATA11bits __at(0x7AB);
// bitfield macros
#define _LCDDATA11_SEG16COM3_POSN                           0x0
#define _LCDDATA11_SEG16COM3_POSITION                       0x0
#define _LCDDATA11_SEG16COM3_SIZE                           0x1
#define _LCDDATA11_SEG16COM3_LENGTH                         0x1
#define _LCDDATA11_SEG16COM3_MASK                           0x1
#define _LCDDATA11_SEG17COM3_POSN                           0x1
#define _LCDDATA11_SEG17COM3_POSITION                       0x1
#define _LCDDATA11_SEG17COM3_SIZE                           0x1
#define _LCDDATA11_SEG17COM3_LENGTH                         0x1
#define _LCDDATA11_SEG17COM3_MASK                           0x2
#define _LCDDATA11_SEG18COM3_POSN                           0x2
#define _LCDDATA11_SEG18COM3_POSITION                       0x2
#define _LCDDATA11_SEG18COM3_SIZE                           0x1
#define _LCDDATA11_SEG18COM3_LENGTH                         0x1
#define _LCDDATA11_SEG18COM3_MASK                           0x4
#define _LCDDATA11_SEG19COM3_POSN                           0x3
#define _LCDDATA11_SEG19COM3_POSITION                       0x3
#define _LCDDATA11_SEG19COM3_SIZE                           0x1
#define _LCDDATA11_SEG19COM3_LENGTH                         0x1
#define _LCDDATA11_SEG19COM3_MASK                           0x8
#define _LCDDATA11_SEG20COM3_POSN                           0x4
#define _LCDDATA11_SEG20COM3_POSITION                       0x4
#define _LCDDATA11_SEG20COM3_SIZE                           0x1
#define _LCDDATA11_SEG20COM3_LENGTH                         0x1
#define _LCDDATA11_SEG20COM3_MASK                           0x10
#define _LCDDATA11_SEG21COM3_POSN                           0x5
#define _LCDDATA11_SEG21COM3_POSITION                       0x5
#define _LCDDATA11_SEG21COM3_SIZE                           0x1
#define _LCDDATA11_SEG21COM3_LENGTH                         0x1
#define _LCDDATA11_SEG21COM3_MASK                           0x20
#define _LCDDATA11_SEG22COM3_POSN                           0x6
#define _LCDDATA11_SEG22COM3_POSITION                       0x6
#define _LCDDATA11_SEG22COM3_SIZE                           0x1
#define _LCDDATA11_SEG22COM3_LENGTH                         0x1
#define _LCDDATA11_SEG22COM3_MASK                           0x40
#define _LCDDATA11_SEG23COM3_POSN                           0x7
#define _LCDDATA11_SEG23COM3_POSITION                       0x7
#define _LCDDATA11_SEG23COM3_SIZE                           0x1
#define _LCDDATA11_SEG23COM3_LENGTH                         0x1
#define _LCDDATA11_SEG23COM3_MASK                           0x80

// Register: LCDDATA12
#define LCDDATA12 LCDDATA12
extern volatile unsigned char           LCDDATA12           __at(0x7AC);
#ifndef _LIB_BUILD
asm("LCDDATA12 equ 07ACh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SEG24COM0              :1;
        unsigned SEG25COM0              :1;
        unsigned SEG26COM0              :1;
        unsigned SEG27COM0              :1;
        unsigned SEG28COM0              :1;
        unsigned SEG29COM0              :1;
        unsigned SEG30COM0              :1;
        unsigned SEG31COM0              :1;
    };
} LCDDATA12bits_t;
extern volatile LCDDATA12bits_t LCDDATA12bits __at(0x7AC);
// bitfield macros
#define _LCDDATA12_SEG24COM0_POSN                           0x0
#define _LCDDATA12_SEG24COM0_POSITION                       0x0
#define _LCDDATA12_SEG24COM0_SIZE                           0x1
#define _LCDDATA12_SEG24COM0_LENGTH                         0x1
#define _LCDDATA12_SEG24COM0_MASK                           0x1
#define _LCDDATA12_SEG25COM0_POSN                           0x1
#define _LCDDATA12_SEG25COM0_POSITION                       0x1
#define _LCDDATA12_SEG25COM0_SIZE                           0x1
#define _LCDDATA12_SEG25COM0_LENGTH                         0x1
#define _LCDDATA12_SEG25COM0_MASK                           0x2
#define _LCDDATA12_SEG26COM0_POSN                           0x2
#define _LCDDATA12_SEG26COM0_POSITION                       0x2
#define _LCDDATA12_SEG26COM0_SIZE                           0x1
#define _LCDDATA12_SEG26COM0_LENGTH                         0x1
#define _LCDDATA12_SEG26COM0_MASK                           0x4
#define _LCDDATA12_SEG27COM0_POSN                           0x3
#define _LCDDATA12_SEG27COM0_POSITION                       0x3
#define _LCDDATA12_SEG27COM0_SIZE                           0x1
#define _LCDDATA12_SEG27COM0_LENGTH                         0x1
#define _LCDDATA12_SEG27COM0_MASK                           0x8
#define _LCDDATA12_SEG28COM0_POSN                           0x4
#define _LCDDATA12_SEG28COM0_POSITION                       0x4
#define _LCDDATA12_SEG28COM0_SIZE                           0x1
#define _LCDDATA12_SEG28COM0_LENGTH                         0x1
#define _LCDDATA12_SEG28COM0_MASK                           0x10
#define _LCDDATA12_SEG29COM0_POSN                           0x5
#define _LCDDATA12_SEG29COM0_POSITION                       0x5
#define _LCDDATA12_SEG29COM0_SIZE                           0x1
#define _LCDDATA12_SEG29COM0_LENGTH                         0x1
#define _LCDDATA12_SEG29COM0_MASK                           0x20
#define _LCDDATA12_SEG30COM0_POSN                           0x6
#define _LCDDATA12_SEG30COM0_POSITION                       0x6
#define _LCDDATA12_SEG30COM0_SIZE                           0x1
#define _LCDDATA12_SEG30COM0_LENGTH                         0x1
#define _LCDDATA12_SEG30COM0_MASK                           0x40
#define _LCDDATA12_SEG31COM0_POSN                           0x7
#define _LCDDATA12_SEG31COM0_POSITION                       0x7
#define _LCDDATA12_SEG31COM0_SIZE                           0x1
#define _LCDDATA12_SEG31COM0_LENGTH                         0x1
#define _LCDDATA12_SEG31COM0_MASK                           0x80

// Register: LCDDATA13
#define LCDDATA13 LCDDATA13
extern volatile unsigned char           LCDDATA13           __at(0x7AD);
#ifndef _LIB_BUILD
asm("LCDDATA13 equ 07ADh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SEG32COM0              :1;
        unsigned SEG33COM0              :1;
        unsigned SEG34COM0              :1;
        unsigned SEG35COM0              :1;
        unsigned SEG36COM0              :1;
        unsigned SEG37COM0              :1;
        unsigned SEG38COM0              :1;
        unsigned SEG39COM0              :1;
    };
} LCDDATA13bits_t;
extern volatile LCDDATA13bits_t LCDDATA13bits __at(0x7AD);
// bitfield macros
#define _LCDDATA13_SEG32COM0_POSN                           0x0
#define _LCDDATA13_SEG32COM0_POSITION                       0x0
#define _LCDDATA13_SEG32COM0_SIZE                           0x1
#define _LCDDATA13_SEG32COM0_LENGTH                         0x1
#define _LCDDATA13_SEG32COM0_MASK                           0x1
#define _LCDDATA13_SEG33COM0_POSN                           0x1
#define _LCDDATA13_SEG33COM0_POSITION                       0x1
#define _LCDDATA13_SEG33COM0_SIZE                           0x1
#define _LCDDATA13_SEG33COM0_LENGTH                         0x1
#define _LCDDATA13_SEG33COM0_MASK                           0x2
#define _LCDDATA13_SEG34COM0_POSN                           0x2
#define _LCDDATA13_SEG34COM0_POSITION                       0x2
#define _LCDDATA13_SEG34COM0_SIZE                           0x1
#define _LCDDATA13_SEG34COM0_LENGTH                         0x1
#define _LCDDATA13_SEG34COM0_MASK                           0x4
#define _LCDDATA13_SEG35COM0_POSN                           0x3
#define _LCDDATA13_SEG35COM0_POSITION                       0x3
#define _LCDDATA13_SEG35COM0_SIZE                           0x1
#define _LCDDATA13_SEG35COM0_LENGTH                         0x1
#define _LCDDATA13_SEG35COM0_MASK                           0x8
#define _LCDDATA13_SEG36COM0_POSN                           0x4
#define _LCDDATA13_SEG36COM0_POSITION                       0x4
#define _LCDDATA13_SEG36COM0_SIZE                           0x1
#define _LCDDATA13_SEG36COM0_LENGTH                         0x1
#define _LCDDATA13_SEG36COM0_MASK                           0x10
#define _LCDDATA13_SEG37COM0_POSN                           0x5
#define _LCDDATA13_SEG37COM0_POSITION                       0x5
#define _LCDDATA13_SEG37COM0_SIZE                           0x1
#define _LCDDATA13_SEG37COM0_LENGTH                         0x1
#define _LCDDATA13_SEG37COM0_MASK                           0x20
#define _LCDDATA13_SEG38COM0_POSN                           0x6
#define _LCDDATA13_SEG38COM0_POSITION                       0x6
#define _LCDDATA13_SEG38COM0_SIZE                           0x1
#define _LCDDATA13_SEG38COM0_LENGTH                         0x1
#define _LCDDATA13_SEG38COM0_MASK                           0x40
#define _LCDDATA13_SEG39COM0_POSN                           0x7
#define _LCDDATA13_SEG39COM0_POSITION                       0x7
#define _LCDDATA13_SEG39COM0_SIZE                           0x1
#define _LCDDATA13_SEG39COM0_LENGTH                         0x1
#define _LCDDATA13_SEG39COM0_MASK                           0x80

// Register: LCDDATA14
#define LCDDATA14 LCDDATA14
extern volatile unsigned char           LCDDATA14           __at(0x7AE);
#ifndef _LIB_BUILD
asm("LCDDATA14 equ 07AEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SEG40COM0              :1;
        unsigned SEG41COM0              :1;
        unsigned SEG42COM0              :1;
        unsigned SEG43COM0              :1;
        unsigned SEG44COM0              :1;
        unsigned SEG45COM0              :1;
    };
} LCDDATA14bits_t;
extern volatile LCDDATA14bits_t LCDDATA14bits __at(0x7AE);
// bitfield macros
#define _LCDDATA14_SEG40COM0_POSN                           0x0
#define _LCDDATA14_SEG40COM0_POSITION                       0x0
#define _LCDDATA14_SEG40COM0_SIZE                           0x1
#define _LCDDATA14_SEG40COM0_LENGTH                         0x1
#define _LCDDATA14_SEG40COM0_MASK                           0x1
#define _LCDDATA14_SEG41COM0_POSN                           0x1
#define _LCDDATA14_SEG41COM0_POSITION                       0x1
#define _LCDDATA14_SEG41COM0_SIZE                           0x1
#define _LCDDATA14_SEG41COM0_LENGTH                         0x1
#define _LCDDATA14_SEG41COM0_MASK                           0x2
#define _LCDDATA14_SEG42COM0_POSN                           0x2
#define _LCDDATA14_SEG42COM0_POSITION                       0x2
#define _LCDDATA14_SEG42COM0_SIZE                           0x1
#define _LCDDATA14_SEG42COM0_LENGTH                         0x1
#define _LCDDATA14_SEG42COM0_MASK                           0x4
#define _LCDDATA14_SEG43COM0_POSN                           0x3
#define _LCDDATA14_SEG43COM0_POSITION                       0x3
#define _LCDDATA14_SEG43COM0_SIZE                           0x1
#define _LCDDATA14_SEG43COM0_LENGTH                         0x1
#define _LCDDATA14_SEG43COM0_MASK                           0x8
#define _LCDDATA14_SEG44COM0_POSN                           0x4
#define _LCDDATA14_SEG44COM0_POSITION                       0x4
#define _LCDDATA14_SEG44COM0_SIZE                           0x1
#define _LCDDATA14_SEG44COM0_LENGTH                         0x1
#define _LCDDATA14_SEG44COM0_MASK                           0x10
#define _LCDDATA14_SEG45COM0_POSN                           0x5
#define _LCDDATA14_SEG45COM0_POSITION                       0x5
#define _LCDDATA14_SEG45COM0_SIZE                           0x1
#define _LCDDATA14_SEG45COM0_LENGTH                         0x1
#define _LCDDATA14_SEG45COM0_MASK                           0x20

